{
  "backend/main.mo": "Motoko canister implementing account management with authorization, auto-generated IDs, transaction history, and transfer logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON object summarizing major frontend files and their purposes across UI, pages, hooks, and utilities.",
  "frontend/.env.development.example": "Template environment file for development mode configuring backend mode and REST base URL.",
  "frontend/.env.example": "Default environment template specifying backend mode and REST API URL.",
  "frontend/.env.staging.example": "Staging environment template enabling REST mode with a staging API URL.",
  "frontend/.vscode/extensions.json": "VS Code extension recommendations for linting, formatting, Motoko, Git tools, and Tailwind.",
  "frontend/.vscode/tasks.json": "VS Code task definitions for installing dependencies, running frontend, starting dfx, deploying canisters, and building.",
  "frontend/admin-portal/.env.example": "Environment template for the admin portal defining backend mode, URL, canister ID, and environment.",
  "frontend/admin-portal/index.html": "HTML entry point that mounts the admin portal React app into the admin-root div.",
  "frontend/admin-portal/README.md": "Explains the purpose, features, environment setup, and development workflow for the standalone ArthaNidhi Admin Portal React app.",
  "frontend/admin-portal/src/AdminApp.tsx": "Root component configuring routing, authentication provider, theming, and the admin layout.",
  "frontend/admin-portal/src/backend/adminBackendClient.ts": "Placeholder backend client supporting IC/REST modes with stubbed admin operations.",
  "frontend/admin-portal/src/components/auth/AdminProtectedRoute.tsx": "Route guard that restricts access to authenticated admin users and redirects others.",
  "frontend/admin-portal/src/components/layout/AdminHeader.tsx": "Header component with branding, theme toggle, and admin account menu with logout.",
  "frontend/admin-portal/src/components/layout/AdminShell.tsx": "Layout wrapper providing header, footer, and page structure for admin views.",
  "frontend/admin-portal/src/config/env.ts": "Loads and validates admin-specific environment variables for backend mode and config.",
  "frontend/admin-portal/src/contexts/AdminAuthContext.tsx": "Implements localStorage‑based admin authentication with signup, login, and session management.",
  "frontend/admin-portal/src/main.tsx": "Bootstraps and renders the AdminApp React application.",
  "frontend/admin-portal/src/pages/AccessDeniedPage.tsx": "Displays an access‑denied message with a prompt to return to login.",
  "frontend/admin-portal/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing placeholder stats and future admin feature descriptions.",
  "frontend/admin-portal/src/pages/AdminForgotPasswordPage.tsx": "Provides an admin password reset form and shows a confirmation message after submission.",
  "frontend/admin-portal/src/pages/AdminLoginPage.tsx": "Implements admin login with email/password, error handling, and redirects authenticated users to the dashboard.",
  "frontend/admin-portal/src/pages/AdminSignupPage.tsx": "Contains admin account creation form with validation and redirects on successful signup.",
  "frontend/admin-portal/src/styles/admin.css": "Imports the main index.css file for admin portal styling.",
  "frontend/DELIVERY_PLAN_BATCHES.md": "Batch-based delivery plan detailing file groups for user and admin portals and how to assemble them.",
  "frontend/docs/CHAT_EXPORT_FORMAT.md": "Describes the required format for exporting the entire project code via chat.",
  "frontend/docs/CHAT_RECONSTRUCTION_GUIDE.md": "Explains how to reconstruct the project locally from chat-delivered source files.",
  "frontend/docs/GITHUB_ONBOARDING.md": "Provides instructions for pushing the project to a new GitHub repository.",
  "frontend/docs/LOCAL_DEVELOPMENT.md": "Guides users through setting up and running the project locally.",
  "frontend/docs/VSCODE_SETUP.md": "Covers recommended VS Code setup and extensions for working on the project.",
  "frontend/index.css": "Defines global Tailwind styles, theme variables, and dark mode support.",
  "frontend/index.html": "Basic HTML entry point that loads the React application.",
  "frontend/README.md": "User portal README describing project overview, stack, prerequisites, and setup instructions.",
  "frontend/REST_BACKEND_CONTRACT.md": "Specification of the REST API contract with security requirements, endpoint structure, and implementation notes.",
  "frontend/src/App.tsx": "Configures application routing, providers, and layout for the main user portal.",
  "frontend/src/backendClient/config.ts": "Reads and validates backend mode and REST base URL from environment variables, providing a BackendConfig object.",
  "frontend/src/backendClient/icClient.ts": "Implements BackendClient using a Motoko actor, handling accounts, transactions, and mock market data for IC mode.",
  "frontend/src/backendClient/index.ts": "Factory module that selects and caches either the IC or REST backend client based on configuration.",
  "frontend/src/backendClient/restClient.ts": "Implements BackendClient over HTTP, performing authenticated fetch requests with BigInt-safe JSON handling.",
  "frontend/src/backendClient/types.ts": "Defines the BackendClient interface, backend mode types, and backend configuration structure.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Redirects unauthenticated users and shows a loading indicator while authentication state is resolving.",
  "frontend/src/components/balance/BalanceAmount.tsx": "Displays a balance string, masking digits with bullets when balance visibility is off.",
  "frontend/src/components/balance/BalanceVisibilityToggle.tsx": "Button to toggle balance visibility using an eye/eye-off icon.",
  "frontend/src/components/dashboard/GoldSilverRatesCard.tsx": "UI card showing dummy gold and silver price calculations based on selected city, karat, and weight.",
  "frontend/src/components/dashboard/NewsCard.tsx": "Renders a financial news card using mock data with scrollable items and a disclaimer banner.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, footer, and responsive sidebar behavior based on authentication.",
  "frontend/src/components/layout/Footer.tsx": "Displays the site footer with branding and demo disclaimers.",
  "frontend/src/components/layout/Header.tsx": "Implements the top header with navigation, theme toggle, user menu, and login/logout handling.",
  "frontend/src/components/layout/Sidebar.tsx": "Renders a navigational sidebar with scroll controls, mobile support, and route-aware highlighting.",
  "frontend/src/components/transfers/TransferDialog.tsx": "A dialog for sending money that validates inputs and triggers a transfer mutation.",
  "frontend/src/contexts/AuthContext.tsx": "Provides a demo localStorage‑based authentication system with signup, login, and session persistence.",
  "frontend/src/contexts/BalanceVisibilityContext.tsx": "Manages balance visibility state using sessionStorage and exposes a toggle function.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, stored identity loading, and AuthClient management.",
  "frontend/src/hooks/useQueries.ts": "Defines data‑fetching hooks for accounts and user profiles, handling actor readiness, REST vs IC modes, and auto‑refetching logic.",
  "frontend/src/hooks/useSettings.ts": "Syncs theme settings with backend preferences and provides a toggle that updates both local and backend state.",
  "frontend/src/index.css": "Configures Tailwind base styles and color variables, including light/dark fintech themes and background effects.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AccountPage.tsx": "Displays account, balance, and financial health data with charts, loading states, and identifier‑generation feedback.",
  "frontend/src/pages/BeneficiariesPage.tsx": "Manages a user's saved beneficiaries with load/save to storage, form validation, add/remove actions, and a dialog UI.",
  "frontend/src/pages/CardsPage.tsx": "Displays a simulated debit card with number masking and lets users freeze/unfreeze the card, persisting state in storage.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user greeting, balance, recent transactions, and dashboard widgets using backend query hooks.",
  "frontend/src/pages/DepositsPage.tsx": "Lists demo deposit products and provides a simple FD maturity calculator based on user inputs.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Provides a demo password reset flow where users submit email and receive a confirmation message.",
  "frontend/src/pages/GoldSilverRatesPage.tsx": "Displays gold and silver rate information along with an explanatory section about pricing factors and karat details.",
  "frontend/src/pages/InsurancePage.tsx": "Renders a filterable list of demo insurance products with coverage, premiums, and features displayed in cards.",
  "frontend/src/pages/LoansPage.tsx": "Shows demo loan products and includes an EMI calculator where users input principal, rate, and tenure.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login form with email/password handling, error display, loading state, and post-login navigation.",
  "frontend/src/pages/MarketInsightsPage.tsx": "Fetches and displays simulated market summary data with trend indicators and a detailed table.",
  "frontend/src/pages/MutualFundsPage.tsx": "Displays simulated mutual fund data with performance metrics and a detailed funds table.",
  "frontend/src/pages/NotificationsPage.tsx": "Renders a notifications list with filtering, read-state management, and persistence via local storage. Includes demo seed data and utilities for formatting timestamps and category colors.",
  "frontend/src/pages/PaymentsPage.tsx": "Provides a demo bill payment form with category selection, validation, simulated processing, and success/error toasts. Resets form after submitting and displays payment-related UI cards.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Loads and edits user profile data, allowing name updates and theme toggling with loading states and mutation handling. Syncs form fields with backend profile or auth fallback.",
  "frontend/src/pages/RewardsOffersPage.tsx": "Displays categorized reward offers with the ability to save or unsave items, persisting selections per user. Supports filtering via tabs and shows demo-mode alerts.",
  "frontend/src/pages/SignupPage.tsx": "Handles user signup with validation, KYC fields, account creation, and backend profile saving. Redirects after successful signup and manages loading and error states.",
  "frontend/src/pages/StatementsPage.tsx": "Renders the statements page with filters, search, date range, and CSV export for transactions using query hooks.",
  "frontend/src/pages/StocksPage.tsx": "Displays simulated stock data with summaries, loading skeletons, and a full table view using useGetStocks.",
  "frontend/src/pages/SupportContactPage.tsx": "Implements a support portal with ticket submission, local persistence, and tabs for contact, tickets, and help topics.",
  "frontend/src/types/index.ts": "Defines TypeScript types for transactions, settings, market data, mutual funds, and stocks used across the frontend.",
  "frontend/src/utils/csv.ts": "Exports transactions to CSV by formatting rows and triggering a download in the browser.",
  "frontend/src/utils/currency.ts": "Provides INR currency formatting helpers for bigint and decimal amounts.",
  "frontend/src/utils/jsonBigint.ts": "Adds JSON helpers to serialize and parse bigint fields safely for REST compatibility.",
  "frontend/src/utils/portalStorage.ts": "Implements per-user localStorage helpers for saving beneficiaries, tickets, notifications, and related demo data.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, OKLCH color tokens, extended shadows, radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project phase-1 UI/feature requirements, architecture notes, known issues, and existing features for ArthaNidhi Pay user and admin portals."
}