{
  "backend/main.mo": "Defines user profile with KYC fields, enforces access control, and provides CRUD-style functions for callers to view and save their own profiles.",
  "backend/migration.mo": "Migrates old user profiles to the new KYC-enabled format by adding empty KYC fields during upgrade.",
  "feature_evidence.json": "Lists implemented features, affected files, components, and test IDs for several UI and backend-related updates.",
  "frontend-file-summaries.txt": "Contains prewritten 1–2 sentence summaries of many frontend files for build planning.",
  "frontend/.env.development.example": "Development environment template configuring backend mode and REST base URL.",
  "frontend/.env.example": "Default environment template specifying backend mode and optional REST API URL.",
  "frontend/.env.staging.example": "Staging environment template using REST mode with a staging backend URL.",
  "frontend/.vscode/extensions.json": "VS Code extension recommendations for formatting, linting, Tailwind, Motoko, and Git utilities.",
  "frontend/.vscode/tasks.json": "VS Code task definitions for installing deps, running frontend dev/staging, starting DFX, deploying backend, and building the frontend.",
  "frontend/admin-portal/.env.example": "Example environment template defining backend mode, URLs, canister ID, and environment for the admin portal.",
  "frontend/admin-portal/index.html": "HTML entry point that mounts the admin React app and loads main.tsx.",
  "frontend/admin-portal/README.md": "Documentation describing the admin portal’s purpose, features, environment setup, and development instructions.",
  "frontend/admin-portal/src/AdminApp.tsx": "Initializes routing, theming, authentication, and global UI providers for the admin portal.",
  "frontend/admin-portal/src/backend/adminBackendClient.ts": "Placeholder backend client supporting IC or REST modes for future admin operations.",
  "frontend/admin-portal/src/components/auth/AdminProtectedRoute.tsx": "Route guard that restricts access to authenticated admin users and handles redirects.",
  "frontend/admin-portal/src/components/layout/AdminHeader.tsx": "Header component showing branding, theme toggle, user menu, and logout for admins.",
  "frontend/admin-portal/src/components/layout/AdminShell.tsx": "Layout wrapper providing header, footer, and main content area for admin pages.",
  "frontend/admin-portal/src/config/env.ts": "Loads and validates admin-specific environment variables for backend mode and settings.",
  "frontend/admin-portal/src/contexts/AdminAuthContext.tsx": "LocalStorage-based admin authentication system handling login, signup, session persistence, and logout.",
  "frontend/admin-portal/src/main.tsx": "Bootstraps the React admin app and renders AdminApp into the root element.",
  "frontend/admin-portal/src/pages/AccessDeniedPage.tsx": "Displays an access-denied message with an option to return to login for unauthorized users.",
  "frontend/admin-portal/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing basic system stats and introductory information for future features.",
  "frontend/admin-portal/src/pages/AdminForgotPasswordPage.tsx": "React page that handles admin password reset request, showing a form and confirmation message after submission.",
  "frontend/admin-portal/src/pages/AdminLoginPage.tsx": "Admin login page with email/password form, loading state, error handling, and redirect on successful authentication.",
  "frontend/admin-portal/src/pages/AdminSignupPage.tsx": "Admin signup page with validation for name, email, password, and confirmation, submitting to create a new admin account.",
  "frontend/admin-portal/src/styles/admin.css": "CSS file importing the project's main index.css for admin styling.",
  "frontend/DELIVERY_PLAN_BATCHES.md": "Outlines ordered batches for assembling the project, detailing shared configs, user portal, admin portal, backend integration, and pages.",
  "frontend/docs/GITHUB_ONBOARDING.md": "Guide for setting up a GitHub repo and initializing Git for the project.",
  "frontend/docs/LOCAL_DEVELOPMENT.md": "Instructions for installing dependencies and running the project locally in IC or REST modes.",
  "frontend/docs/VSCODE_SETUP.md": "Recommended VS Code extensions and setup guidance for development.",
  "frontend/index.css": "Tailwind CSS base file defining color variables, themes, and global styles.",
  "frontend/index.html": "Root HTML entry file mounting the app and loading the main React script.",
  "frontend/README.md": "Project overview explaining user/admin portals, setup steps, environment usage, and development instructions.",
  "frontend/REST_BACKEND_CONTRACT.md": "Specifies the full REST API contract and security requirements for a Node.js backend used in REST mode.",
  "frontend/src/App.tsx": "Main app component configuring routes, providers, layouts, and protected routes using TanStack Router.",
  "frontend/src/backendClient/config.ts": "Reads environment variables to configure backend mode and REST base URL, validating values and providing defaults.",
  "frontend/src/backendClient/icClient.ts": "Implements BackendClient for IC mode, delegating profile operations to the actor and returning mock data for all other features.",
  "frontend/src/backendClient/index.ts": "Factory that returns either an IC or REST backend client based on configuration, with caching and mode-based invalidation.",
  "frontend/src/backendClient/restClient.ts": "Implements BackendClient for REST mode using fetch, handling auth, BigInt serialization, errors, and all API operations.",
  "frontend/src/backendClient/types.ts": "Defines the BackendClient interface and related types to unify IC and REST backend implementations.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Protects routes by redirecting unauthenticated users and displaying a loading state while authentication is checked.",
  "frontend/src/components/dashboard/GoldSilverRatesCard.tsx": "UI card that displays dummy gold and silver rates with selectable city, karat, and weight options.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper that renders the header, footer, and page content.",
  "frontend/src/components/layout/Footer.tsx": "Footer component showing branding, copyright, and a disclaimer.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, theme toggle, authentication controls, and responsive mobile menu.",
  "frontend/src/contexts/AuthContext.tsx": "Implements a demo localStorage-based auth system with signup, login, logout, and session persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a canister actor tied to the user's Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend API calls with React Query, supporting both REST and IC modes for user data, balance, statements, and transactions.",
  "frontend/src/hooks/useSettings.ts": "Syncs theme settings with backend preferences and handles updating user settings.",
  "frontend/src/index.css": "Defines Tailwind layers and app-wide light/dark theme CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, and Internet Identity provider.",
  "frontend/src/pages/AccountPage.tsx": "Displays account overview with balance, financial health metrics, and charts using data from backend queries.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the user's dashboard with balance, recent transactions, quick navigation actions, and gold/silver rates. Fetches user profile, balance, and statements via query hooks.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Implements a simple password reset flow where users submit their email and receive a demo confirmation message. Provides navigation back to login.",
  "frontend/src/pages/GoldSilverRatesPage.tsx": "Shows gold and silver rates using a reusable rates card and provides explanatory information about metal pricing and karat details.",
  "frontend/src/pages/LoginPage.tsx": "Handles user login with email and password, showing errors and redirecting authenticated users to the dashboard. Includes form validation and loading states.",
  "frontend/src/pages/MarketInsightsPage.tsx": "Displays simulated Indian market data, including asset summaries and a detailed table view, with loading skeletons and informational warnings.",
  "frontend/src/pages/MutualFundsPage.tsx": "Fetches and displays simulated mutual fund data with performance metrics, offering both card summaries and a detailed table view.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Renders the user profile settings UI, allowing display name updates and theme toggling while handling profile loading and mutation states.",
  "frontend/src/pages/SignupPage.tsx": "Implements the signup form with validation, authentication flow, and saving of extended KYC profile data before redirecting to the dashboard.",
  "frontend/src/pages/StatementsPage.tsx": "Displays account statements with filters, search, date range handling, and CSV export functionality using transaction queries.",
  "frontend/src/pages/StocksPage.tsx": "Shows simulated stock market data with summary cards and a detailed table, supporting loading states and formatted price/change displays.",
  "frontend/src/types/index.ts": "Defines shared TypeScript types for transactions, settings, market data, mutual funds, and stocks used across the frontend.",
  "frontend/src/utils/csv.ts": "Exports a list of transactions to a downloadable CSV file with formatted fields and proper escaping.",
  "frontend/src/utils/currency.ts": "Provides INR currency formatting helpers for bigint and decimal values.",
  "frontend/src/utils/jsonBigint.ts": "Implements JSON helpers that serialize bigints as strings and parse them back based on known bigint field names.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, container settings, animations, and plugin integrations for the frontend theme.",
  "project_state.json": "Stores the project’s current phase requirements, architecture notes, known issues, and asset guidelines used for planning ongoing updates."
}