{
  "backend/main.mo": "Motoko backend defining user profiles, accounts, transactions, market data types, and secure access-controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, and test IDs with high-level metadata.",
  "frontend-file-summaries.txt": "Collection of concise summaries describing the purpose of various frontend source files.",
  "frontend/.env.example": "Example environment file defining backend mode and REST API base URL for the user portal.",
  "frontend/admin-portal/.env.example": "Example environment file specifying admin portal backend mode, URLs, and environment settings.",
  "frontend/admin-portal/index.html": "HTML entry point that mounts the admin React app at admin-root and loads main.tsx.",
  "frontend/admin-portal/README.md": "Explains the admin portal’s purpose, features, environment setup, and how to run it alongside the user portal.",
  "frontend/admin-portal/src/AdminApp.tsx": "Sets up routing, theming, authentication, and layout wrappers for the admin portal’s root app.",
  "frontend/admin-portal/src/backend/adminBackendClient.ts": "Placeholder backend client supporting IC/REST modes with stub admin operations.",
  "frontend/admin-portal/src/components/auth/AdminProtectedRoute.tsx": "Route guard that restricts access to authenticated admin users and redirects unauthorized users.",
  "frontend/admin-portal/src/components/layout/AdminHeader.tsx": "Header bar with navigation, theme toggle, user menu, and logout handling for admin users.",
  "frontend/admin-portal/src/components/layout/AdminShell.tsx": "Layout wrapper providing header, footer, and themed background for admin pages.",
  "frontend/admin-portal/src/config/env.ts": "Loads and validates admin-specific environment variables for IC/REST backend modes.",
  "frontend/admin-portal/src/contexts/AdminAuthContext.tsx": "Implements localStorage-based admin authentication with signup, login, logout, and session management.",
  "frontend/admin-portal/src/main.tsx": "Bootstraps the admin React app and renders AdminApp into the admin-root element.",
  "frontend/admin-portal/src/pages/AccessDeniedPage.tsx": "Access denied screen shown when a non-admin attempts to access restricted pages.",
  "frontend/admin-portal/src/pages/AdminDashboardPage.tsx": "Displays the admin dashboard with basic system stats placeholders and upcoming feature notes.",
  "frontend/admin-portal/src/pages/AdminForgotPasswordPage.tsx": "Renders a demo admin password reset form that collects an email and shows a confirmation message after submission.",
  "frontend/admin-portal/src/pages/AdminLoginPage.tsx": "Implements the admin login form with authentication, error handling, and redirects for authenticated users.",
  "frontend/admin-portal/src/pages/AdminSignupPage.tsx": "Provides an admin signup form with validation, error handling, and redirects on successful account creation.",
  "frontend/admin-portal/src/styles/admin.css": "Imports the shared global stylesheet from the main frontend.",
  "frontend/DELIVERY_PLAN_BATCHES.md": "Batch-based delivery plan outlining file groups and build order for user and admin portals.",
  "frontend/index.css": "Defines Tailwind layers and custom CSS variables for theming, including dark mode overrides.",
  "frontend/index.html": "Base HTML file that mounts the app and loads the main TypeScript entry point.",
  "frontend/README.md": "Project overview and setup guide explaining user and admin portals, authentication, and development workflow.",
  "frontend/REST_BACKEND_CONTRACT.md": "Specification document detailing the REST API contract and required security considerations for the Node backend.",
  "frontend/src/App.tsx": "Sets up the application's routing, providers, and protected routes within the main AppShell layout.",
  "frontend/src/backendClient/config.ts": "Loads and validates backend mode configuration from environment variables for IC or REST operation.",
  "frontend/src/backendClient/icClient.ts": "Implements a backend client that forwards calls to an Internet Computer actor for user data, settings, and transactions.",
  "frontend/src/backendClient/index.ts": "Factory that returns a cached IC or REST backend client based on config and supports cache clearing.",
  "frontend/src/backendClient/restClient.ts": "Implements a REST-based BackendClient using fetch with auth headers, bigint-safe JSON handling, and wrappers for profile, balance, transactions, and market data endpoints.",
  "frontend/src/backendClient/types.ts": "Defines the BackendClient interface and related config types, specifying all API operations the frontend can call.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Protects routes by redirecting unauthenticated users and showing a loading spinner while auth state initializes.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper that renders the header, footer, and main content area.",
  "frontend/src/components/layout/Footer.tsx": "Renders the footer with branding, disclaimer text, and credits.",
  "frontend/src/components/layout/Header.tsx": "Provides the main navigation header with theme toggle, account menu, mobile menu, and auth-aware navigation.",
  "frontend/src/contexts/AuthContext.tsx": "Implements a localStorage-based demo auth system supporting signup, login, logout, and session persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an IC backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, stored identities, and exposes functions to login or clear identity.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user data, balance, statements, and transactions, supporting both REST and actor-based modes.",
  "frontend/src/hooks/useSettings.ts": "Syncs backend settings with UI theme and provides a toggle for dark/light mode, updating backend preferences when authenticated.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables for light and dark themes, and utility classes including background wave images.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountPage.tsx": "Displays balance and financial health metrics using charts and cards, pulling data via custom hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Shows an overview of user profile, balance, recent transactions, and quick navigation actions with logout capability.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Implements a demo password reset flow with email input and confirmation messaging.",
  "frontend/src/pages/LoginPage.tsx": "Login page that handles user authentication with email and password, showing errors and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/MarketInsightsPage.tsx": "Displays simulated Indian market data with summary cards and a detailed table, showing loading skeletons while fetching.",
  "frontend/src/pages/MutualFundsPage.tsx": "Shows simulated mutual fund data with performance cards and a detailed table, including loading states and change indicators.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "User settings page allowing profile updates and theme toggling, with form handling and loading states.",
  "frontend/src/pages/SignupPage.tsx": "Signup page that creates new accounts with validation for name, email, and passwords, then redirects to the dashboard.",
  "frontend/src/pages/StatementsPage.tsx": "Renders the account statements page with filters, search, date range selection, and CSV export for transactions.",
  "frontend/src/pages/StocksPage.tsx": "Displays simulated stock data with summary cards and a full table, handling loading states and formatting values.",
  "frontend/src/utils/csv.ts": "Converts transactions to CSV format and triggers a browser download with proper escaping and metadata.",
  "frontend/src/utils/currency.ts": "Provides INR currency formatting helpers for bigint and decimal values.",
  "frontend/src/utils/jsonBigint.ts": "Adds JSON stringify/parse helpers that convert bigint fields to and from strings for API compatibility.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugin setup for the frontend UI.",
  "project_state.json": "Holds the project’s current state, requirements, architecture notes, and planned banking features."
}