{
  "backend/main.mo": "Motoko canister managing user accounts, authentication checks, and transactions with auto-generated IDs and account numbers.",
  "feature_evidence.json": "Feature evidence listing two UI-related background-image features with associated components and files.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short technical summaries for build planning.",
  "frontend/.env.development.example": "Environment template configuring development mode, backend mode, and REST API base URL.",
  "frontend/.env.example": "Default environment template defining backend mode and REST API URL for user portal.",
  "frontend/.env.staging.example": "Staging environment template using REST backend mode with staging API URL placeholder.",
  "frontend/.vscode/extensions.json": "VS Code extension recommendations for linting, formatting, Tailwind, Motoko, and tooling.",
  "frontend/.vscode/tasks.json": "VS Code task definitions for installing dependencies, running dev/staging builds, starting DFX, and building frontend.",
  "frontend/admin-portal/.env.example": "Example environment config for the admin portal defining backend mode, URLs, canister ID, and environment.",
  "frontend/admin-portal/index.html": "HTML entry point that loads the admin portal root div and boots the React application.",
  "frontend/admin-portal/README.md": "Documentation explaining the admin portal's purpose, features, setup steps, environment variables, and authentication system.",
  "frontend/admin-portal/src/AdminApp.tsx": "Root React component configuring routing, theming, authentication, and global providers for the admin portal.",
  "frontend/admin-portal/src/backend/adminBackendClient.ts": "Placeholder backend client for admin operations, supporting IC and REST modes with stubbed methods.",
  "frontend/admin-portal/src/components/auth/AdminProtectedRoute.tsx": "Route guard that restricts access to authenticated admin users and handles loading and redirection.",
  "frontend/admin-portal/src/components/layout/AdminHeader.tsx": "Header component providing navigation, theme toggle, and admin account dropdown with logout.",
  "frontend/admin-portal/src/components/layout/AdminShell.tsx": "Layout wrapper that includes the header, footer, and page structure for admin views.",
  "frontend/admin-portal/src/config/env.ts": "Loads and validates admin-specific environment variables for backend mode and environment settings.",
  "frontend/admin-portal/src/contexts/AdminAuthContext.tsx": "LocalStorage-based admin authentication system handling signup, login, session persistence, and logout.",
  "frontend/admin-portal/src/main.tsx": "Application entry script that initializes React and renders AdminApp into the DOM.",
  "frontend/admin-portal/src/pages/AccessDeniedPage.tsx": "Page displayed when a non-admin user tries to access restricted admin sections.",
  "frontend/admin-portal/src/pages/AdminDashboardPage.tsx": "Dashboard UI showing admin welcome text and placeholder system metrics and future feature notes.",
  "frontend/admin-portal/src/pages/AdminForgotPasswordPage.tsx": "Provides an admin password reset form with email input and a confirmation message after submission.",
  "frontend/admin-portal/src/pages/AdminLoginPage.tsx": "Implements the admin login form with authentication handling, error display, and redirect on success.",
  "frontend/admin-portal/src/pages/AdminSignupPage.tsx": "Implements admin registration with validation for name, email, password, and redirects after successful signup.",
  "frontend/admin-portal/src/styles/admin.css": "Imports shared global styles into the admin portal.",
  "frontend/DELIVERY_PLAN_BATCHES.md": "Structured delivery plan describing batch-by-batch assembly of user and admin portals with shared assets.",
  "frontend/docs/GITHUB_ONBOARDING.md": "Guide for setting up a GitHub repo and initializing project version control.",
  "frontend/docs/LOCAL_DEVELOPMENT.md": "Instructions for installing dependencies and running the project locally in different modes.",
  "frontend/docs/VSCODE_SETUP.md": "Lists recommended VS Code extensions and setup steps for development.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for theming including light and dark mode.",
  "frontend/index.html": "HTML entrypoint that loads the main React application.",
  "frontend/README.md": "Project overview and setup guide for user and admin portals with environment instructions.",
  "frontend/REST_BACKEND_CONTRACT.md": "Specification of required REST API contract, security requirements, and endpoint rules for external backend.",
  "frontend/src/App.tsx": "Sets up routing, providers, and protected routes for the main application structure.",
  "frontend/src/backendClient/config.ts": "Parses environment variables to select IC or REST backend mode and validates the REST base URL.",
  "frontend/src/backendClient/icClient.ts": "Implements BackendClient using a Motoko actor for account and transaction operations and mock data for markets.",
  "frontend/src/backendClient/index.ts": "Creates and caches either an IC or REST backend client based on configuration and provided actor.",
  "frontend/src/backendClient/restClient.ts": "Implements BackendClient over HTTP using fetch with auth, error handling, and bigint‑safe JSON parsing.",
  "frontend/src/backendClient/types.ts": "Defines the BackendClient interface and backend configuration types used by IC and REST clients.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Guards routes by redirecting unauthenticated users and showing a loading indicator while auth state loads.",
  "frontend/src/components/dashboard/GoldSilverRatesCard.tsx": "Displays dummy gold and silver prices with selectors for city, karat, and weight.",
  "frontend/src/components/dashboard/NewsCard.tsx": "Shows a scrollable list of mock financial news items with category icons and a demo disclaimer.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper that renders header, footer, and responsive sidebar, adjusting behavior based on authentication state and mobile menu toggle.",
  "frontend/src/components/layout/Footer.tsx": "Static footer showing logo, copyright text, and a demo disclaimer.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, theme toggle, mobile menu button, and authenticated user dropdown including logout and settings.",
  "frontend/src/components/layout/Sidebar.tsx": "Sidebar navigation listing main app sections, highlighting the active route and supporting mobile close behavior.",
  "frontend/src/components/transfers/TransferDialog.tsx": "Dialog for initiating money transfers with form validation, balance checks, and submission via transfer mutation.",
  "frontend/src/contexts/AuthContext.tsx": "LocalStorage‑based demo auth system managing signup, login, logout, and session persistence.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identities, and exposing login state. Includes auth‑client initialization and helpers to access or clear identity.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as caller account and user profile. Handles auto‑refetching logic, backend mode differences, and actor availability.",
  "frontend/src/hooks/useSettings.ts": "Manages theme settings by syncing backend preferences with the UI and allowing theme toggling. Uses authentication state to conditionally update backend settings.",
  "frontend/src/index.css": "Configures Tailwind base styles, CSS variables, and light/dark theme palettes. Adds a premium dark‑mode background and various utility styles.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider. Renders the main App component and imports global CSS.",
  "frontend/src/pages/AccountPage.tsx": "Displays account identifiers, balance details, and financial health charts. Handles loading states, backend initialization delays, and errors.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user greeting, balance, recent transactions, and dashboard widgets. Fetches profile and financial data while updating the UI with time‑based greetings.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Provides a demo password reset form that captures an email and shows confirmation messaging on submit.",
  "frontend/src/pages/GoldSilverRatesPage.tsx": "Displays current gold and silver rates via a card component along with informational content about metal pricing.",
  "frontend/src/pages/LoginPage.tsx": "Implements a login form with email/password, error handling, loading states, and redirects after authentication.",
  "frontend/src/pages/MarketInsightsPage.tsx": "Fetches and displays simulated market summary data with cards and a detailed table, including loading and informational alerts.",
  "frontend/src/pages/MutualFundsPage.tsx": "Shows simulated mutual fund data in cards and a detailed table, with loading states and basic performance metrics.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Allows users to view and update their profile name and theme, using backend profile data and mutation handling.",
  "frontend/src/pages/SignupPage.tsx": "Signup form handling account creation, KYC fields, validation, and saving user profile before redirecting to the dashboard.",
  "frontend/src/pages/StatementsPage.tsx": "Displays transaction history with filters, search, date range, export to CSV, and balance display.",
  "frontend/src/pages/StocksPage.tsx": "Fetches and displays simulated stock data with summaries, performance indicators, and a detailed table.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces for transactions, settings, market data, mutual funds, and stocks.",
  "frontend/src/utils/csv.ts": "Converts transactions into CSV format and triggers a browser download.",
  "frontend/src/utils/currency.ts": "Provides helpers for formatting INR currency values with and without decimals.",
  "frontend/src/utils/jsonBigint.ts": "Adds JSON helpers to serialize bigints as strings and parse them back using heuristics.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL or session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "TailwindCSS config enabling dark mode, content scanning, custom fonts, OKLCH-based color tokens, extended shadows, radii, and animations via plugins.",
  "project_state.json": "Defines current project state, requirements, architectural notes, and known issues for Phase 1 of the ArthaNidhi Pay user portal."
}