{
  "backend/main.mo": "Motoko canister managing user profiles with access control, allowing users or admins to view/save profiles under permission checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file containing short summaries of numerous frontend files describing their purpose and functionality.",
  "frontend/.env.development.example": "Development environment template configuring backend mode and REST API base URL.",
  "frontend/.env.example": "Default environment template defining backend mode and optional REST API base URL.",
  "frontend/.env.staging.example": "Staging environment template using REST mode with placeholder staging backend URL.",
  "frontend/.vscode/extensions.json": "VS Code recommended extensions list for linting, formatting, Tailwind, Motoko, and productivity tools.",
  "frontend/.vscode/tasks.json": "VS Code task definitions for installing dependencies, running dev servers, starting DFX, deploying canisters, and building the frontend.",
  "frontend/admin-portal/.env.example": "Environment template for the admin portal defining backend mode, backend URL, canister ID, and environment mode.",
  "frontend/admin-portal/index.html": "HTML entry point that mounts the admin React app at #admin-root and loads main.tsx.",
  "frontend/admin-portal/README.md": "Documentation explaining the admin portal’s purpose, features, environment setup, and development workflow.",
  "frontend/admin-portal/src/AdminApp.tsx": "Root component wiring up routing, theme, authentication, and toast notifications for the admin portal.",
  "frontend/admin-portal/src/backend/adminBackendClient.ts": "Placeholder backend client supporting IC/REST modes with stub admin operations.",
  "frontend/admin-portal/src/components/auth/AdminProtectedRoute.tsx": "Route guard that restricts access to authenticated admins and redirects unauthorized users.",
  "frontend/admin-portal/src/components/layout/AdminHeader.tsx": "Header UI with navigation, theme toggle, user menu, and logout support.",
  "frontend/admin-portal/src/components/layout/AdminShell.tsx": "Layout wrapper providing header, main content area, and footer for admin pages.",
  "frontend/admin-portal/src/config/env.ts": "Loads and validates admin-specific environment variables for backend mode and configuration.",
  "frontend/admin-portal/src/contexts/AdminAuthContext.tsx": "Implements localStorage‑based admin authentication with signup, login, session persistence, and logout.",
  "frontend/admin-portal/src/main.tsx": "App bootstrap that renders AdminApp into the admin-root DOM element.",
  "frontend/admin-portal/src/pages/AccessDeniedPage.tsx": "Access denied page informing users they lack admin permissions and providing a link back to login.",
  "frontend/admin-portal/src/pages/AdminDashboardPage.tsx": "Admin dashboard displaying placeholder stats and an overview of planned admin features.",
  "frontend/admin-portal/src/pages/AdminForgotPasswordPage.tsx": "Provides an admin password reset form and shows a confirmation message after submission.",
  "frontend/admin-portal/src/pages/AdminLoginPage.tsx": "Implements the admin login form with authentication, error handling, and redirect on success.",
  "frontend/admin-portal/src/pages/AdminSignupPage.tsx": "Implements admin account creation with validation, error display, and redirect after successful signup.",
  "frontend/admin-portal/src/styles/admin.css": "Imports the main index.css for admin portal styling.",
  "frontend/DELIVERY_PLAN_BATCHES.md": "Delivery plan outlining batch-by-batch assembly order for user and admin portal codebases.",
  "frontend/docs/GITHUB_ONBOARDING.md": "Explains how to create a GitHub repo and push the project code.",
  "frontend/docs/LOCAL_DEVELOPMENT.md": "Provides setup and run instructions for local development of ArthaNidhi Pay.",
  "frontend/docs/VSCODE_SETUP.md": "Lists recommended VS Code extensions and setup steps for development.",
  "frontend/index.css": "Defines Tailwind layers and CSS variables for themes and UI styling.",
  "frontend/index.html": "Base HTML file containing the root div and script entry point.",
  "frontend/README.md": "Project overview and setup guide for user and admin portals, including installation, environment files, and dev instructions.",
  "frontend/REST_BACKEND_CONTRACT.md": "Specification of the REST API contract required for the frontend’s REST mode, including security and endpoint guidelines.",
  "frontend/src/App.tsx": "Configures routing, providers, and protected routes for the main application shell.",
  "frontend/src/backendClient/config.ts": "Loads backend mode and REST base URL from env vars with validation and defaults.",
  "frontend/src/backendClient/icClient.ts": "Implements BackendClient for IC, delegating profile calls to the actor and returning mock data for others.",
  "frontend/src/backendClient/index.ts": "Factory that returns cached IC or REST backend clients based on configuration and manages cache resets.",
  "frontend/src/backendClient/restClient.ts": "Implements BackendClient over REST using fetch with auth headers, bigint-safe JSON, and structured error handling.",
  "frontend/src/backendClient/types.ts": "Defines the BackendClient interface and supporting backend mode/config types for IC and REST implementations.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Redirects unauthenticated users to home and shows a loading state while auth is being checked.",
  "frontend/src/components/dashboard/GoldSilverRatesCard.tsx": "UI card showing dummy gold and silver rate calculations based on city, karat, and weight selections.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing header, footer, and page structure.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying branding, attribution, and a demo-purpose note.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, theme toggle, user menu, and mobile sidebar support.",
  "frontend/src/contexts/AuthContext.tsx": "Implements a localStorage-based demo auth system with signup, login, logout, and session persistence. Provides an AuthProvider exposing user state and authentication actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an IC actor based on Internet Identity and invalidates related queries when identity changes. Initializes access control with an optional secret token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, stored identities, and login state via a context provider. Wraps AuthClient setup and exposes identity, login, and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, balances, statements, and transactions using either REST or IC actors. Handles conditional enabling based on backend mode and actor availability.",
  "frontend/src/hooks/useSettings.ts": "Syncs backend user settings with the UI theme and allows toggling theme with backend updates. Integrates identity state and backend mode awareness.",
  "frontend/src/index.css": "Defines Tailwind base styles, light/dark theme color variables, and gradient backgrounds. Adds utility classes and global styling for the application.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider. Renders the root App component and imports global CSS.",
  "frontend/src/pages/AccountPage.tsx": "Displays balance and financial health using charts and cards, fetching data via custom queries.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user greeting, balance, quick actions, and recent transactions using profile and statement data.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Implements a demo password-reset form that collects email and shows confirmation messaging.",
  "frontend/src/pages/LoginPage.tsx": "Provides login form with validation, error handling, and redirects upon successful authentication.",
  "frontend/src/pages/MarketInsightsPage.tsx": "Fetches and displays simulated market data with summary cards and a detailed table view.",
  "frontend/src/pages/MutualFundsPage.tsx": "Shows simulated mutual funds data with performance cards and a detailed table list.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Profile settings form that loads user data, allows updating display name, shows email, and toggles theme.",
  "frontend/src/pages/SignupPage.tsx": "Signup form handling name, email, and password creation with validation and navigation on success.",
  "frontend/src/pages/StatementsPage.tsx": "Displays account statements with filters, search, CSV export, and date/type filtering logic.",
  "frontend/src/pages/StocksPage.tsx": "Fetches and displays simulated stock data with summary cards and a detailed table.",
  "frontend/src/types/index.ts": "Shared type definitions for transactions, settings, market data, mutual funds, and stocks.",
  "frontend/src/utils/csv.ts": "Utility to convert transactions into CSV format and trigger a client-side download.",
  "frontend/src/utils/currency.ts": "Currency formatting helpers for INR values with and without decimals.",
  "frontend/src/utils/jsonBigint.ts": "Helpers for JSON stringify/parse that convert bigint values to and from strings for API compatibility.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL and hash parameters, persist them in sessionStorage, and clear stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, typography, container settings, animations, and plugin usage.",
  "project_state.json": "Metadata describing the project's current phase, architecture notes, known issues, required assets, and planned features."
}