{
  "backend/main.mo": "Motoko canister handling user accounts, auth checks, and transfers with autogenerated IDs and in-memory account map.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "List of summaries describing major frontend files and their roles.",
  "frontend/.env.development.example": "Development env template configuring backend mode and optional REST URL.",
  "frontend/.env.example": "Default env template specifying backend mode and REST base URL.",
  "frontend/.env.staging.example": "Staging env template forcing REST mode with staging backend URL.",
  "frontend/.vscode/extensions.json": "VS Code extension recommendations for frontend development.",
  "frontend/.vscode/tasks.json": "VS Code tasks for installing, running, building frontend and deploying backend.",
  "frontend/admin-portal/.env.example": "Environment template for admin portal backend mode and URLs.",
  "frontend/admin-portal/index.html": "HTML entry point mounting admin portal root element.",
  "frontend/admin-portal/README.md": "Admin portal overview, features, setup steps, and environment details.",
  "frontend/admin-portal/src/AdminApp.tsx": "Sets up the admin portal root with routing, theming, authentication provider, and layout shell.",
  "frontend/admin-portal/src/backend/adminBackendClient.ts": "Provides a placeholder backend client for admin operations with mode and URL configuration.",
  "frontend/admin-portal/src/components/auth/AdminProtectedRoute.tsx": "Protects routes by checking admin authentication and role, redirecting unauthorized users.",
  "frontend/admin-portal/src/components/layout/AdminHeader.tsx": "Renders the admin portal header with navigation, theme toggle, and authenticated admin menu.",
  "frontend/admin-portal/src/components/layout/AdminShell.tsx": "Layout wrapper providing header, content container, and footer for admin pages.",
  "frontend/admin-portal/src/config/env.ts": "Loads and validates admin-specific environment variables for backend mode and configuration.",
  "frontend/admin-portal/src/contexts/AdminAuthContext.tsx": "Implements localStorage-based admin authentication with signup, login, logout, and session persistence.",
  "frontend/admin-portal/src/main.tsx": "Bootstraps the admin portal by rendering AdminApp into the admin-root DOM element.",
  "frontend/admin-portal/src/pages/AccessDeniedPage.tsx": "Displays an access-denied message with navigation back to the login page.",
  "frontend/admin-portal/src/pages/AdminDashboardPage.tsx": "Shows the admin dashboard with placeholder stats and an overview of upcoming admin features.",
  "frontend/admin-portal/src/pages/AdminForgotPasswordPage.tsx": "Provides a demo password reset form for admins with confirmation messaging.",
  "frontend/admin-portal/src/pages/AdminLoginPage.tsx": "Provides the admin login form with email/password authentication, handling redirects and error states.",
  "frontend/admin-portal/src/pages/AdminSignupPage.tsx": "Implements admin account creation with validation for name, email, and password fields.",
  "frontend/admin-portal/src/styles/admin.css": "Imports the global index.css stylesheet into the admin portal.",
  "frontend/DELIVERY_PLAN_BATCHES.md": "Detailed batch-based assembly plan for user and admin portal codebases.",
  "frontend/docs/CHAT_EXPORT_FORMAT.md": "Explains the required chat-based format for exporting full project code when the export feature is unavailable.",
  "frontend/docs/CHAT_RECONSTRUCTION_GUIDE.md": "Provides steps for reconstructing the entire project locally from chat-delivered source files.",
  "frontend/docs/GITHUB_ONBOARDING.md": "Guides users through creating a GitHub repo and pushing the project code.",
  "frontend/docs/LOCAL_DEVELOPMENT.md": "Instructions for installing dependencies and running the user portal locally.",
  "frontend/docs/VSCODE_SETUP.md": "Describes how to configure VS Code for optimal development of the project.",
  "frontend/index.css": "Defines Tailwind base layers and custom CSS variables for theming in light and dark modes.",
  "frontend/index.html": "Main HTML entry point loading the root div and bootstrapping the frontend app.",
  "frontend/README.md": "User portal README with overview and quick start instructions.",
  "frontend/REST_BACKEND_CONTRACT.md": "REST API contract outlining required endpoints and security expectations.",
  "frontend/src/App.tsx": "Sets up routing, providers, and protected routes for the main app using TanStack Router.",
  "frontend/src/backendClient/config.ts": "Reads and validates backend mode and REST base URL from environment variables.",
  "frontend/src/backendClient/icClient.ts": "Implements the IC backend client using a Motoko actor, handling accounts, transactions, financial health, and mock market data.",
  "frontend/src/backendClient/index.ts": "Provides a factory that returns a cached IC or REST backend client based on configuration.",
  "frontend/src/backendClient/restClient.ts": "Implements the REST backend client with fetch-based API calls, auth headers, bigint handling, and error parsing.",
  "frontend/src/backendClient/types.ts": "Defines the BackendClient interface and backend config types for IC and REST modes.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Protects routes by redirecting unauthenticated users and showing a loading UI.",
  "frontend/src/components/balance/BalanceAmount.tsx": "Displays a balance with optional masking based on visibility settings.",
  "frontend/src/components/balance/BalanceVisibilityToggle.tsx": "Provides a button to toggle balance visibility with eye icons.",
  "frontend/src/components/dashboard/GoldSilverRatesCard.tsx": "Renders a card showing dummy gold and silver prices with selectors for city, karat, and weight.",
  "frontend/src/components/dashboard/NewsCard.tsx": "Displays mock financial news items in a scrollable card with a demo disclaimer.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper that renders header, footer, and responsive sidebar with mobile menu control based on authentication state.",
  "frontend/src/components/layout/Footer.tsx": "Simple footer displaying logo, copyright text, and demo disclaimer.",
  "frontend/src/components/layout/Header.tsx": "Top navigation bar with logo, theme toggle, account menu, and mobile menu trigger tied to auth state.",
  "frontend/src/components/layout/Sidebar.tsx": "Navigation sidebar listing app routes with icons, mobile/desktop modes, and scroll controls.",
  "frontend/src/components/transfers/TransferDialog.tsx": "Dialog for submitting money transfers with validation, balance checks, and mutation handling.",
  "frontend/src/contexts/AuthContext.tsx": "LocalStorage‑based demo auth system providing signup, login, logout, and session persistence.",
  "frontend/src/contexts/BalanceVisibilityContext.tsx": "Context managing toggleable balance visibility persisted in sessionStorage.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, loading stored identities, and handling login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend account, user profile, and related data with retry logic and actor support.",
  "frontend/src/hooks/useSettings.ts": "Syncs user theme settings with backend preferences and provides a toggle that updates both frontend and backend.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, color variables for light/dark themes, and glossy background effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AccountPage.tsx": "Renders the account overview with balance, financial health charts, and account identifier loading states.",
  "frontend/src/pages/BeneficiariesPage.tsx": "Manages CRUD operations for user beneficiaries using local storage with validation and UI dialogs.",
  "frontend/src/pages/CardsPage.tsx": "Page for viewing a demo debit card, toggling card number visibility, and freezing/unfreezing card state with persisted storage.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing greeting, balance, recent transactions, and related widgets like gold/silver rates and news.",
  "frontend/src/pages/DepositsPage.tsx": "Displays demo fixed and recurring deposit products and includes a simple FD maturity calculator.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Demo password reset page allowing users to submit an email and view confirmation messaging.",
  "frontend/src/pages/GoldSilverRatesPage.tsx": "Shows gold and silver rate information with an explanatory section on pricing and purity.",
  "frontend/src/pages/InsurancePage.tsx": "Lists demo insurance products with filtering and displays details like coverage, premiums, and features.",
  "frontend/src/pages/LoansPage.tsx": "Displays loan products and includes an EMI calculator with form inputs and computed results.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login form with authentication handling, error display, and redirects for authenticated users.",
  "frontend/src/pages/MarketInsightsPage.tsx": "Fetches and displays simulated market summary data with cards and a detailed table, including loading states.",
  "frontend/src/pages/MutualFundsPage.tsx": "Loads and shows mutual fund data in summary cards and a detailed table with simulated performance metrics.",
  "frontend/src/pages/NotificationsPage.tsx": "Manages user notifications with filtering, read status updates, persistence, and categorized UI display.",
  "frontend/src/pages/PaymentsPage.tsx": "Implements a demo bill‑payment form with category selection, validation, and simulated processing using toast notifications.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Displays and updates user profile info with name editing, theme settings, and backend mutation handling.",
  "frontend/src/pages/RewardsOffersPage.tsx": "Shows categorized reward offers with save/unsave functionality stored per user and filtered by tabs.",
  "frontend/src/pages/SignupPage.tsx": "Handles user signup with validation, KYC fields, account creation, and saving the profile before redirecting.",
  "frontend/src/pages/StatementsPage.tsx": "Provides transaction history filtering, searching, exporting to CSV, and displays balance and statements.",
  "frontend/src/pages/StocksPage.tsx": "Displays simulated Indian stock data with loading skeletons, summary cards, and a full table view.",
  "frontend/src/pages/SupportContactPage.tsx": "Provides a support center with ticket submission, ticket history stored locally, and help topics.",
  "frontend/src/pages/TransferPage.tsx": "Implements money transfer form with validation, balance checks, and transfer mutation handling.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces for transactions, settings, market data, mutual funds, and stocks.",
  "frontend/src/utils/csv.ts": "Exports transactions as a downloadable CSV file with formatted fields.",
  "frontend/src/utils/currency.ts": "Provides INR currency formatting helpers for whole and decimal amounts.",
  "frontend/src/utils/jsonBigint.ts": "Adds JSON stringify/parse helpers to safely handle bigint values using string serialization.",
  "frontend/src/utils/portalStorage.ts": "Manages per-user localStorage data for beneficiaries, tickets, notifications, and other items.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter parsing, persistence via sessionStorage, and cleanup utilities.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, shadows, animations, and container settings, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state defining Phase 1 user portal updates, architectural notes, known issues, and existing features for ongoing UI and functional changes."
}