{
  "kind": "build_request",
  "title": "Fix missing Gold & Silver dummy rates section and correct the User Portal logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Ensure the User Portal Dashboard renders a visible \"Gold & Silver Rates\" dummy-data section for all authenticated users (including existing users), with dropdown controls for (1) Indian capital city, (2) karat 18/22/24, and (3) weight 1g/10g/100g/1000g, and display calculated dummy prices in INR (₹) based on the selected options.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Gold and Silver rate dummy data section are not showing."
        ]
      },
      "acceptanceCriteria": [
        "When logged in, the Dashboard page shows a clearly labeled \"Gold & Silver Rates\" section without requiring any special user state.",
        "The section includes dropdowns for city (Indian capital cities), karat (18/22/24), and weight (1g/10g/100g/1000g).",
        "Changing any dropdown selection updates the displayed dummy price(s) immediately in the UI.",
        "All displayed currency values use INR formatting with the ₹ symbol (consistent with the existing currency utilities).",
        "The section renders reliably for existing users (e.g., the previously reported user 'abc'), not only newly created users."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Fix the User Portal logo so that the correct ArthaNidhi Pay logo artwork is used consistently across the User Portal UI (at minimum: header and footer), replacing the currently referenced logo asset path(s) where needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "And logo is not correct."
        ]
      },
      "acceptanceCriteria": [
        "The header logo and footer logo display the same, correct ArthaNidhi Pay logo artwork.",
        "There are no remaining references to an incorrect logo asset path (e.g., outdated filenames/locations) in the User Portal header/footer.",
        "User-facing alt text remains English and accurately describes the logo (e.g., \"ArthaNidhi\")."
      ]
    }
  ],
  "constraints": [
    "Apply changes to the ArthaNidhi Pay User Portal only; do not modify Admin Portal behavior or integrate Admin Portal data flows as part of this fix.",
    "Do not edit files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text added or modified."
  ],
  "nonGoals": [
    "Implementing real-time gold/silver pricing or integrating any external APIs for commodity rates.",
    "Changing authentication, backend storage, or adding new backend endpoints solely for the gold/silver dummy module.",
    "Redesigning unrelated pages beyond what is necessary to restore the missing section and correct the logo asset usage."
  ],
  "imageRequirements": {
    "required": [
      "ArthaNidhi Pay logo (clean modern wordmark + icon) on transparent background (arthanidhi-logo.dim_512x512.png)"
    ],
    "edits": []
  }
}