{
  "kind": "build_request",
  "title": "Update User Portal logo, revert background theme, and fix missing Signup KYC + Gold/Silver rates visibility",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "Add the uploaded image (Screenshot 2026-02-06 012037-4.png) as the canonical ArthaNidhi Pay logo static asset under `frontend/public/assets/generated/`, and update the User Portal UI to use this new logo everywhere a logo is shown (at minimum: global Header and Footer; include any auth pages that display a logo).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "man asking this image as the logo"
        ]
      },
      "acceptanceCriteria": [
        "A new logo image file derived from the uploaded screenshot exists under `frontend/public/assets/generated/`.",
        "User Portal Header uses the new logo asset path (no remaining references to the old logo path for the visible header logo).",
        "User Portal Footer uses the new logo asset path (no remaining references to the old logo path for the visible footer logo).",
        "If the Login/Signup UI displays a logo/brand mark anywhere, it also uses the same new logo asset path.",
        "All user-facing alt text remains in English."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Revert the User Portal background styling to the earlier agreed background color/theme (do not use the current multi-color gradient background), and apply the reverted background consistently across unauthenticated and authenticated User Portal pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "use the earlier background color we used don't use this one color gradient"
        ]
      },
      "acceptanceCriteria": [
        "The global page background no longer uses the current multi-color gradient.",
        "The background style is consistent across at least: Login, Signup, Dashboard, Market Insights, Mutual Funds, and Stocks pages.",
        "No user-facing text is changed to a non-English language as part of this update."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Ensure the full KYC section is rendered and required during User Portal signup (i.e., KYC fields are visible on the Signup page and validated before account creation), and ensure the KYC data is persisted with the user profile so it can be retrieved after signup.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "kyc is still not showing here in the signup"
        ]
      },
      "acceptanceCriteria": [
        "The Signup page displays a clearly labeled KYC section with required fields (the form cannot be submitted until required KYC fields are completed).",
        "If required KYC fields are missing, the user sees an English validation message and signup is blocked.",
        "On successful signup, the submitted KYC data is stored and can be fetched back for the authenticated user (via existing profile fetch mechanisms)."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Fix Gold & Silver Rates visibility by ensuring it is accessible and visible to authenticated users: (1) the dashboard must render the Gold & Silver Rates module reliably for all authenticated users, and (2) add a dedicated protected Gold & Silver Rates page/route if the UI currently expects a separate page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "gold and silver rate page is not showing."
        ]
      },
      "acceptanceCriteria": [
        "After login, the Dashboard shows a visible \"Gold & Silver Rates\" section for any authenticated user.",
        "If a dedicated page is added, it is protected (requires authentication) and can be navigated to from the authenticated navigation/menu.",
        "All labels and disclaimers on the Gold & Silver Rates UI remain in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (Shadcn UI components are read-only).",
    "Do not modify any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep Motoko backend as a single-actor architecture in `backend/main.mo`; only introduce `backend/migration.mo` if an upgrade-safe state migration is required."
  ],
  "nonGoals": [
    "Do not add external API integrations for live gold/silver pricing (dummy/simulated values only).",
    "Do not change Admin Portal behavior or integrate Admin Portal with User Portal as part of this request."
  ],
  "imageRequirements": {
    "required": [
      "ArthaNidhi logo wordmark with infinity loop mark in cyan/blue and orange accents (arthanidhi-logo-uploaded.dim_1200x600.png)"
    ],
    "edits": []
  }
}