{
  "kind": "build_request",
  "title": "Generate and apply premium dark-mode banking background (India-focused)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-52",
      "text": "Generate a premium, high-resolution dark-mode website background image suitable for an Indian digital banking/fintech UI, using deep navy blue and charcoal tones as the base, subtle accents of blue and white, and very minimal saffron or green highlights; include soft gradients, gentle glow lines, and minimal abstract elements representing finance, growth, digital payments, and secure transactions; ensure the image contains no people, no text, no logos, and no watermarks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Create a premium dark mode banking website background suitable for Indian users.\nUse deep navy blue and charcoal tones as the base, with subtle accents of blue, white,\nand very minimal saffron or green highlights.\n\nDesign should feel professional, secure, and government-compliant, suitable for an\nenterprise-grade Indian digital banking or fintech platform.\nUse soft gradients, gentle glow lines, and minimal abstract elements representing\nfinance, growth, digital payments, and secure transactions.\n\nClean, modern, and accessible UI background with high contrast for readability.\nEye-friendly, trustworthy, and authoritative appearance.\nNo people, no text, no logos, no watermark.\nHigh resolution, modern fintech aesthetic."
        ]
      },
      "acceptanceCriteria": [
        "A new background image file is added under `frontend/public/assets/generated/` with the exact filename specified in the image requirements.",
        "The generated image is visually consistent with: deep navy + charcoal base, subtle blue/white accents, and only minimal saffron/green highlights.",
        "The image contains no people, no text, no logos, and no watermarks.",
        "The image is high resolution and suitable for full-page background use without visible pixelation."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Apply the newly generated dark-mode banking background image across the ArthaNidhi Pay User Portal in dark mode (unauthenticated and authenticated pages), ensuring readable contrast for all primary UI surfaces (cards, tables, form fields, and navigation) while keeping the background subtle and non-distracting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Clean, modern, and accessible UI background with high contrast for readability.\nEye-friendly, trustworthy, and authoritative appearance."
        ]
      },
      "acceptanceCriteria": [
        "When the app theme is set to dark mode, the generated background image is visible on core screens (at minimum: Login, Signup, Dashboard, Account, Statements, Market Insights, Mutual Funds, Stocks, Gold & Silver Rates, Profile/Settings).",
        "Foreground content maintains high contrast and remains readable over the background (no low-contrast text or icons).",
        "No user-facing text is added or modified in a non-English language as part of this change.",
        "Light mode behavior is not regressed (light mode continues to render as before unless explicitly updated to maintain overall visual consistency)."
      ]
    }
  ],
  "constraints": [
    "Do not introduce any external APIs or image hosting; the background must be a static asset stored under `frontend/public/assets/generated/`.",
    "Do not add any people, text, logos, or watermarks to the generated background image.",
    "Do not edit files under `frontend/src/components/ui` or other immutable frontend paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change application features, data models, authentication flows, or backend behavior as part of this request.",
    "Do not redesign page layouts beyond what is necessary to safely apply the background and preserve readability/accessibility."
  ],
  "imageRequirements": {
    "required": [
      "Premium dark-mode fintech abstract background in deep navy and charcoal with soft gradients, gentle glow lines, subtle blue/white accents, and minimal saffron/green highlights; high contrast; no text/logos/people/watermarks (banking-bg-dark-india.dim_3840x2160.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}