{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "User Portal branding/theme fixes, Signup KYC restoration, and Gold/Silver rates visibility",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Add the uploaded ArthaNidhi Pay logo as a generated static asset and update all User Portal logo usages to reference it.",
      "acceptanceCriteria": [
        "A new logo image file derived from the uploaded screenshot exists under `frontend/public/assets/generated/`.",
        "User Portal Header uses the new logo asset path (no remaining references to the old logo path for the visible header logo).",
        "User Portal Footer uses the new logo asset path (no remaining references to the old logo path for the visible footer logo).",
        "If the Login/Signup UI displays a logo/brand mark anywhere, it also uses the same new logo asset path.",
        "All user-facing alt text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/arthanidhi-logo-uploaded.dim_1200x600.png",
          "operation": "create",
          "description": "Add the canonical ArthaNidhi Pay logo image (derived from the uploaded screenshot) as a static asset at this exact path."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Update the header logo <img> to use the new generated logo asset at `frontend/public/assets/generated/arthanidhi-logo-uploaded.dim_1200x600.png` and keep alt text in English."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Update the footer logo <img> to use the new generated logo asset at `frontend/public/assets/generated/arthanidhi-logo-uploaded.dim_1200x600.png` and keep alt text in English."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Update the login page brand/logo image to use `frontend/public/assets/generated/arthanidhi-logo-uploaded.dim_1200x600.png` and keep all user-facing text/alt text in English."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Revert global User Portal background styling from the current multi-color gradient to the earlier solid theme and apply consistently across pages.",
      "acceptanceCriteria": [
        "The global page background no longer uses the current multi-color gradient.",
        "The background style is consistent across at least: Login, Signup, Dashboard, Market Insights, Mutual Funds, and Stocks pages.",
        "No user-facing text is changed to a non-English language as part of this update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove/replace the current multi-color gradient background styles (including body and wave background utilities) with the earlier agreed solid background color/theme based on existing design tokens so it applies consistently across the app."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Update the app shell wrapper classes so the global background is consistently applied for both unauthenticated and authenticated pages without relying on the removed gradient utility."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Restore a required KYC section on the Signup page and persist submitted KYC data via the existing profile save mechanism so it can be fetched after signup.",
      "acceptanceCriteria": [
        "The Signup page displays a clearly labeled KYC section with required fields (the form cannot be submitted until required KYC fields are completed).",
        "If required KYC fields are missing, the user sees an English validation message and signup is blocked.",
        "On successful signup, the submitted KYC data is stored and can be fetched back for the authenticated user (via existing profile fetch mechanisms)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SignupPage.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled KYC section to the signup form with required fields aligned to the existing UserProfile shape (dateOfBirth, idDocumentNumber, address) and enforce English validation messaging that blocks submission until completed. After successful signup, persist the profile via the existing backend client/profile save flow (e.g., saveCallerUserProfile) so useGetCallerUserProfile can retrieve it for the authenticated user."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the existing profile query/mutation hooks support the updated signup flow by reliably invalidating/refetching the caller profile after signup-triggered profile persistence (no language changes in user-facing strings)."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Ensure Gold & Silver Rates are visible for authenticated users on the Dashboard and provide a dedicated protected page/route with navigation access.",
      "acceptanceCriteria": [
        "After login, the Dashboard shows a visible \"Gold & Silver Rates\" section for any authenticated user.",
        "If a dedicated page is added, it is protected (requires authentication) and can be navigated to from the authenticated navigation/menu.",
        "All labels and disclaimers on the Gold & Silver Rates UI remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GoldSilverRatesPage.tsx",
          "operation": "create",
          "description": "Create a dedicated Gold & Silver Rates page that renders the existing GoldSilverRatesCard for authenticated users and keeps all labels/disclaimers in English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Gold & Silver Rates page into TanStack Router as a protected route wrapped by ProtectedRoute (requires authentication)."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Add an authenticated navigation/menu item for \"Gold & Silver Rates\" linking to the new protected route so users can reliably access it after login."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Confirm the Dashboard reliably renders a visible Gold & Silver Rates section for any authenticated user (keep the existing GoldSilverRatesCard placement and ensure it is not conditionally hidden)."
        }
      ]
    }
  ]
}