{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Premium India-focused dark-mode banking background (static asset + global dark theme application)",
  "requirements": [
    {
      "id": "REQ-52",
      "summary": "Add the generated premium dark-mode fintech background image as a static frontend asset.",
      "acceptanceCriteria": [
        "A new background image file is added under `frontend/public/assets/generated/` with the exact filename specified in the image requirements.",
        "The generated image is visually consistent with: deep navy + charcoal base, subtle blue/white accents, and only minimal saffron/green highlights.",
        "The image contains no people, no text, no logos, and no watermarks.",
        "The image is high resolution and suitable for full-page background use without visible pixelation."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/banking-bg-dark-india.dim_3840x2160.png",
          "operation": "create",
          "description": "Add the generated static background image asset at exactly `frontend/public/assets/generated/banking-bg-dark-india.dim_3840x2160.png`, ensuring it matches the requested dark-mode Indian fintech aesthetic (no people/text/logos/watermarks)."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Apply the generated background image globally in dark mode across unauthenticated and authenticated user-portal pages while preserving readability and not regressing light mode.",
      "acceptanceCriteria": [
        "When the app theme is set to dark mode, the generated background image is visible on core screens (at minimum: Login, Signup, Dashboard, Account, Statements, Market Insights, Mutual Funds, Stocks, Gold & Silver Rates, Profile/Settings).",
        "Foreground content maintains high contrast and remains readable over the background (no low-contrast text or icons).",
        "No user-facing text is added or modified in a non-English language as part of this change.",
        "Light mode behavior is not regressed (light mode continues to render as before unless explicitly updated to maintain overall visual consistency)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "In dark mode only, apply `frontend/public/assets/generated/banking-bg-dark-india.dim_3840x2160.png` as the global page background (e.g., via `html.dark body` styling) with appropriate sizing/positioning and a safe fallback background color so the image is subtle and non-distracting while keeping text/cards/tables/forms readable; do not change light-mode background behavior."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Ensure the main app layout allows the body background image to remain visible on both unauthenticated and authenticated screens (Login/Signup and all protected routes) without introducing readability regressions (e.g., avoid any layout-level solid backgrounds that would fully cover the body background, while keeping existing UI surfaces readable)."
        }
      ]
    }
  ]
}