{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Gold & Silver dummy rates section on Dashboard and fix User Portal logo asset",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Add a reliably visible \"Gold & Silver Rates\" dummy-data section on the authenticated User Portal Dashboard with city/karat/weight dropdowns and INR (₹) dummy price calculations that update immediately.",
      "acceptanceCriteria": [
        "When logged in, the Dashboard page shows a clearly labeled \"Gold & Silver Rates\" section without requiring any special user state.",
        "The section includes dropdowns for city (Indian capital cities), karat (18/22/24), and weight (1g/10g/100g/1000g).",
        "Changing any dropdown selection updates the displayed dummy price(s) immediately in the UI.",
        "All displayed currency values use INR formatting with the ₹ symbol (consistent with the existing currency utilities).",
        "The section renders reliably for existing users (e.g., the previously reported user 'abc'), not only newly created users."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/GoldSilverRatesCard.tsx",
          "operation": "create",
          "description": "Create a Dashboard-only component that renders a clearly labeled \"Gold & Silver Rates\" dummy section with three dropdown controls (Indian capital city, karat 18/22/24, and weight 1g/10g/100g/1000g) and computed dummy Gold + Silver prices formatted using the existing INR currency utilities; ensure UI updates immediately on selection changes and does not depend on user profile presence or any special user state."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Wire the new GoldSilverRatesCard into the authenticated Dashboard page so it always renders for logged-in users (including existing users) and appears as a visible section alongside existing dashboard cards (no additional auth/profile gating beyond the existing ProtectedRoute)."
        },
        {
          "path": "frontend/src/utils/currency.ts",
          "operation": "modify",
          "description": "Ensure the currency helpers support consistent INR (₹) formatting for the dummy rate display (e.g., confirm/extend decimal vs whole-amount formatting as needed for gold/silver dummy prices while keeping existing usages intact)."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Replace incorrect User Portal logo references so the correct ArthaNidhi Pay logo artwork is used consistently in the header and footer.",
      "acceptanceCriteria": [
        "The header logo and footer logo display the same, correct ArthaNidhi Pay logo artwork.",
        "There are no remaining references to an incorrect logo asset path (e.g., outdated filenames/locations) in the User Portal header/footer.",
        "User-facing alt text remains English and accurately describes the logo (e.g., \"ArthaNidhi\")."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/arthanidhi-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated ArthaNidhi Pay logo asset to the User Portal public assets so it can be referenced consistently by the header and footer (ensure the file is available at exactly: frontend/public/assets/generated/arthanidhi-logo.dim_512x512.png)."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Update the User Portal header logo to reference the correct generated logo asset at frontend/public/assets/generated/arthanidhi-logo.dim_512x512.png (replacing the currently referenced incorrect asset path) and ensure English alt text remains accurate (e.g., \"ArthaNidhi\")."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Update the User Portal footer logo to reference the same correct generated logo asset at frontend/public/assets/generated/arthanidhi-logo.dim_512x512.png (replacing the currently referenced incorrect asset path) and ensure English alt text remains accurate (e.g., \"ArthaNidhi\")."
        }
      ]
    }
  ]
}